# Packages and Applications
# cask install to /Applications
cask_args appdir: "/Applications"

# ==============================================================================
# CLI (brew)
# ==============================================================================

## Core
brew "curl"
brew "git"
brew "jq"
brew "tree"
brew "coreutils"

## Dev environment
brew "mise"
brew "direnv"

## Modern CLI tools
brew "bat"
brew "eza"
brew "fd"
brew "fzf"
brew "ripgrep"
brew "zoxide"

## Git tools
brew "gh"
brew "ghq"
brew "delta"
brew "difftastic"
brew "lazygit"

## Editor / TUI
brew "neovim"
brew "tree-sitter"
brew "tmux"
brew "yazi"

## Service CLI
brew "googleworkspace-cli"
tap "steipete/tap"
brew "steipete/tap/summarize"

## DB
brew "mysql"
brew "postgresql"

## Zsh plugins
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

# ==============================================================================
# Applications (cask)
# ==============================================================================

## Browser
cask "google-chrome"

## Communication
cask "slack"
cask "discord"

## Productivity
cask "1password"
cask "notion"
cask "google-drive"
cask "raycast"

## macOS utils
cask "karabiner-elements"
cask "loop"               # window manager (loop-keybinds.json が設定)
cask "jordanbaird-ice"    # menu bar manager
cask "azookey"            # 日本語 IME
cask "pixelsnap"

## Terminal / Editor
cask "warp"
cask "cmux"
cask "zed"

## Dev tools
brew "mas"                 # Mac App Store CLI (for Xcode install/update)
brew "xcbeautify"          # readable xcodebuild output
brew "swiftformat"
brew "swiftlint"
brew "xcode-build-server"  # SourceKit-LSP support for Xcode projects
brew "ios-deploy"          # install/debug iOS apps on physical devices
brew "fastlane"
brew "cocoapods"
cask "tableplus"

## Unused (kept for reference)
# tap "sanemat/font" # for brew "sanemat/font/ricty"
# brew "sanemat/font/ricty"
# cask "google-japanese-ime"
# cask "spark"
# cask "iterm2"
