# Packages and Applications
# cask install to /Applications
cask_args appdir: "/Applications"

## Tap
tap "sanemat/font" # for brew "sanemat/font/ricty"
tap "heroku/brew" # for brew "heroku/brew/heroku"
tap "stripe/stripe-cli" # for brew "stripe/stripe-cli/stripe"

## Core
brew "git"
brew "ghq"
brew "peco"
brew "zsh-autosuggestions"
brew "zsh-completions"
cask "iterm2"
brew "sanemat/font/ricty"
cask "google-japanese-ime"
cask "karabiner-elements"
cask "pixelsnap"
cask "monitorcontrol"
cask "rectangle"
cask "alfred"
cask "raycast"
cask "google-chrome"
cask "google-drive"

## Default
cask "slack"
cask "discord"
cask "spark"
cask "github"
cask "1password"
cask "notion"
cask "tradingview"

## Development
### Tool
cask "visual-studio-code"
### Command
brew "curl"
brew "jq"
brew "tree"
### Language
brew "asdf"
### DB
brew "mysql"
brew "postgresql"
cask "tableplus"
### Service
cask "docker"
brew "heroku/brew/heroku"
brew "stripe/stripe-cli/stripe"
cask "gitify"

## Other
