# Packages and Applications
# cask install to /Applications
cask_args appdir: "/Applications"

## Core
cask "google-chrome"
cask "google-drive"

## Default
cask "slack"
cask "discord"
cask "github"
cask "1password"
cask "notion"
cask "notion-calendar"
cask "arc"
cask "chatgpt"
cask "kindle"
# cask "xnapper"

## Utils
cask "karabiner-elements"
cask "raycast"

## Editor
cask "visual-studio-code"

## Command
brew "curl"
brew "jq"
brew "tree"
brew "git"

## CLI Tools (previously managed by Nix)
brew "fd"
brew "fzf"
brew "ripgrep"
brew "zoxide"
brew "bat"
brew "eza"
brew "neovim"
brew "yazi"
brew "gh"
brew "ghq"
brew "delta"
brew "difftastic"
brew "lazygit"
brew "tmux"
brew "tree-sitter"

## Language
brew "coreutils"

## DB
brew "mysql"
brew "postgresql"
cask "tableplus"

## Service
cask "docker"

## Zsh Plugins
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zsh-history-substring-search"

## Other
# tap "sanemat/font" # for brew "sanemat/font/ricty"
# brew "sanemat/font/ricty"
# cask "google-japanese-ime"
# cask "pixelsnap"
# cask "spark"
# cask "iterm2"
# cask "warp"

